{
  "titleInfoRelevante": "INFORMACIÓN RELEVANTE",
  "textInfoRelevante": "Este documento establece los \"Términos y Condiciones de Uso\" que rigen la relación jurídica entre <strong>LOFTY APPS/ loftyapps.com</strong> cuyo titular de todos sus derechos es <b>ARGESWARE SOCIEDAD DE RESPONSABILIDAD LIMITADA (ARGESWARE, S. DE R.L.)</b> (en lo sucesivo <b>\" LOFTY APPS \"</b>) y el <b>USUARIO</b> (\"Usuario\" o cualquier denominación que tácita o expresamente haga referencia a un usuario).",
  "text2InfoRelevante":"Es requisito necesario que para el uso del software en <a href=\"https://loftyapps.com/\">https://loftyapps.com/</a> (<b>LOFTY APPS</b> o cualquier nombre que a futuro se use), el usuario lea y acepte los siguientes Términos y Condiciones que a continuación se redactan. En caso de seguir navegando en nuestra página web acepta los presentes Términos y Condiciones de Uso y podrá acceder a los servicios ofrecidos a través del software <b>LOFTY APPS</b>. El uso del software <b>LOFTY APPS</b> así como registrarse como usuario en cualquiera de sus modalidades presentes o futuras implicará que usted ha leído y aceptado los Términos y Condiciones de Uso en el presente documento",
  "textTester":"<p> Es vital esto para <b>PROBAR</b> que si funciona </p>",
  "text3InfoRelevante":"LEA ESTAS CONDICIONES DETENIDAMENTE ANTES DE ACCEDER O USAR EL SOFTWARE <b>LOFTY APPS, CON EL PROPÓSITO DE ASEGURARSE DE QUE USTED ENTIENDE CADA DISPOSICIÓN, LAS CUALES SE DESCRIBEN A CONTINUACIÓN.</b>",
  "text4InfoRelevante":"Mediante su acceso o uso de los Servicios usted acuerda obligarse al cumplimiento de los presentes Términos y Condiciones, los cuales regulan la relación contractual entre usted y del software <b>LOFTY APPS</b>. Si usted no acepta estos Términos y Condiciones, no podrá acceder o usar los Servicios. <b>LOFTY APPS</b> podrá poner fin de manera inmediata a estos Términos y Condiciones o cualquiera de los Servicios respecto de usted o, en general, dejar de ofrecer o denegar el acceso o uso de los Servicios de manera total o parcial, en cualquier momento y por cualquier motivo.",
  "text5InfoRelevante":"<b>LOFTY APPS</b> podrá modificar los presentes Términos y Condiciones relativos a los Servicios cuando lo considere conveniente, con un simple aviso por cualquier medio a los usuarios. Las modificaciones serán efectivas después de la comunicación por parte de <b>LOFTY APPS</b> bajo cualquier modalidad de los Términos y Condiciones actualizados sobre el Servicio aplicable. Su posterior acceso o uso continuado de los Servicios después de dicha comunicación constituye su consentimiento tácito y vinculante hacia los presentes Términos y Condiciones y sus modificaciones.",
  "text6InfoRelevante":"La recopilación y el uso que hacemos de su información personal en relación con los Servicios será tratada conforme a las políticas de privacidad de <b>LOFTY APPS</b>, las cuales se pueden consultar en los portales web o la aplicación. <b>LOFTY APPS</b> podrá facilitar aquella información personal cuando se vea obligado a suministrarla para atender una orden administrativa o judicial emitida por una autoridad competente.",
  "titleTerminologia":"TERMINOLOGÍA DE LOFTY APPS.",
  "list1Terminologia":"<li> Colección de datos: se puede decir que es una tabla donde se almacenan los datos que genera la aplicación web del usuario.</li>",
  "list2Terminologia":"<li>Servicios o Endpoints: Es una interfaz de acceso para gestionar los datos de una colección de datos</li>",
  "list3Terminologia":"<li>Sistema de autenticación: Funcionalidad donde el usuario se pueda autenticar en la aplicación web.</li>",
  "list4Terminologia":"<li> Plugins: funcionalidad prefabricada para que lo pueda integrar el usuario en su aplicación web.</li>",
  "list5Terminologia":"<li>App Web: Aplicación web del usuario.</li>",
  "list6Terminologia":"<li>Backoffice: Sistema que tiene como finalidad de gestionar la información que genera la aplicación web del usuario.</li>",
  "title3Main":"USTED RECONOCE QUE LOFTY APPS NO PRESTA SERVICIOS PROFESIONALES DE DESARROLLO DIRECTO PARA LOS USUARIOS.",
  "textContentMain":"Todos los servicios ofrecidos por las <b>LOFTY APPS</b> son ofrecidos y aceptadas por terceras personas que se han registrado como usuarios y no constituyen la contratación de servicios profesionales para el desarrollo de aplicaciones web. Los servicios en los que se requiere una transacción monetaria son procesados por una Institución Financiera debidamente inscrita conforme las leyes de Honduras. Para registrarse como usuario en cualquier modalidad y gozar de los servicios disponibles en <b>LOFTY APPS</b>, será necesario el registro, lo que significa el ingresar datos personales fidedignos.",
  "titleServices":"LOS SERVICIOS.",
  "textServices":"El software <b>LOFTY APPS</b> constituye una plataforma de tecnología que permite a quienes acepten estas Condiciones beneficiarse mutuamente del uso de esta a través de una plataforma <b>NO CODE</b>, la cual es una herramienta donde puedes desarrollar software sin necesidad de codificar. Entonces podemos decir que <b>LOFTY APPS</b> es una plataforma <b>NO CODE</b> que permite crear aplicaciones web de una manera más rápida y sencilla.",
  "titleLicense":"LICENCIA.",
  "text1License":"Sujeto al cumplimiento de estos Términos y Condiciones, <b>LOFTY APPS</b> le otorga una licencia limitada, no exclusiva, no sublicenciable, revocable, y no transferible para: (i) el acceso y uso de las Aplicaciones en su dispositivo personal solo en relación con su uso de los Servicios; y (ii) el acceso y uso de cualquier contenido, información y material relacionado que pueda ponerse a disposición a través de <b>LOFTY APPS</b>, en cada caso solo para su uso personal y comercial bajo una licencia <b>\"MIT\"</b>, en cuanto a las aplicaciones creadas por el usuario. <b>LOFTY APPS</b> y sus licenciantes se reservan cualquier derecho que no haya sido expresamente otorgado por las presentes condiciones.",
  "text2License":"Una licencia <b>\"MIT\"</b>, es permisiva, corta y simple con condiciones que solo requieren la preservación de los derechos de autor y los avisos de licencia. Las obras con licencia, modificaciones y obras más grandes pueden distribuirse bajo diferentes términos y sin código fuente bajo el siguiente entendimiento:",
  "text3License":"Por la presente se concede permiso, de forma gratuita, a cualquier persona que obtenga acceso este software y archivos de documentación asociados (el \"Software\"), para tratar en el Software sin restricciones, incluidos, entre otros, los derechos para usar, copiar, modificar, fusionar, publicar, distribuir, sublicenciar y/o vender copias de las aplicaciones creadas por el usuario, y para permitir a las personas para lo cual deberá incorporarse el aviso de derechos de autor.",
  "text4License":"El software se proporciona \"tal cual\", sin garantía de ningún tipo, expresa o implícito, incluyendo pero no limitado a las garantías de comerciabilidad, idoneidad para un fin determinado y no infracción. En ningún caso los autores o titulares de derechos de autor serán responsables de cualquier reclamación, daños u otros responsabilidad, ya sea en una acción contractual, extracontractual o de otro tipo, derivada de, fuera de o en conexión con el software o el uso u otras transacciones en el software.",
  "titleRestrictions":"RESTRICCIONES.",
  "text1Restrictions":"Usted no podrá: (i) retirar cualquier nota de derechos de autor, marca registrada u otra nota de propiedad de cualquier parte de <b>LOFTY APPS</b>;(ii) reproducir, modificar, preparar obras derivadas sobre los Servicios, distribuir, licenciar, arrendar, revender, transferir, exhibir públicamente, presentar públicamente, transmitir, retransmitir o explotar de otra forma los Servicios, excepto cuando esto sea permitido expresamente por <b>LOFTY APPS</b>; o (iii) intentar obtener un acceso no autorizado o dañar cualquier aspecto de los Servicios o sus sistemas o redes relacionados.",
  "text2Restrictions":"Los Servicios y todos los derechos relativos a estos son y permanecerán como propiedad de <b>LOFTY APPS</b> o de sus licenciantes, en las formas y tiempos en los que <b>LOFTY APPS</b> determine. Ninguno de estos Términos y Condiciones ni su uso de los Servicios le transfiere u otorgan ningún derecho: (i) sobre o en relación con los Servicios, excepto en cuanto a la licencia limitada otorgada anteriormente; o bien (ii) a utilizar o mencionar en cualquier modo los nombres de la empresa, logotipos, nombres de producto y servicio, marcas comerciales o marcas de servicio de <b>LOFTY APPS</b> o de sus licenciantes.",
  "titlePrestac":"PRESTACIÓN DE LA PLATAFORMA TECNOLÓGICA.",
  "textPrestac":"Usted reconoce que partes de la Plataforma NO CODE podrán ponerse a disposición bajo varias marcas u opciones de <b>LOFTY APPS</b>.",
  "titleUseServices":"USO DE SERVICIOS",
  "titleUseUser":"USUARIO.",
  "text1UseUser":"Con el fin de usar la mayor parte de los aspectos de los Servicios, usted debe registrarse y mantener activa una cuenta personal de usuario de los Servicios (\"Cuenta\"). Usted se compromete a mantener la información en su Cuenta de forma exacta, completa y actualizada. Si no mantiene la información de Cuenta de forma exacta, completa y actualizada, incluso el tener un método de pago inválido o que haya vencido, podrá resultar en su imposibilidad para acceder y utilizar los Servicios o en la resolución por parte de <b>LOFTY APPS</b> de estos Términos y Condiciones. Usted es responsable de toda la actividad que ocurre en su Cuenta y se compromete a mantener en todo momento de forma segura y secreta el nombre de usuario y la contraseña de su Cuenta.",
  "text2UseUser":"<b>LOFTY APPS</b> se reserva el derecho de poner a disposición diferentes tipos de cuentas para distintos tipos de usuarios. <b>LOFTY APPS</b> podrá, a su sola discreción, crear, mantener y administrar estos distintos tipos de cuenta. Su cuenta le da acceso para el uso de los servicios y funcionalidades por la plataforma <b>NO CODE</b>. Si al abrir una cuenta con nosotros, usted lo hace en nombre de una persona jurídica, tal y como una sociedad, asociación, fundación u otro tipo entidad, usted declara y garantiza tener las facultades de acuerdo con la legislación aplicable necesarias para aceptar y por ende obligar a dicha persona jurídica a los presentes Términos y Condiciones",
  "titleReq":"REQUISITOS Y CONDUCTA DEL USUARIO.",
  "text1Req":"El Servicio no está disponible para el uso de personas menores de 18 años. No podrá ceder o transferir de otro modo su Cuenta a cualquier otra persona o entidad. Usted acuerda cumplir con todas las leyes aplicables al utilizar los Servicios y solo podrá utilizar los Servicios con fines legítimos. En algunos casos, <b>LOFTY APPS</b> podrá denegar el uso de los Servicios si en el cumplimiento de estos ello pudiese significar un riesgo para sus usuarios o para terceros (p. ej., actividades delictivas y/o terroristas). ",
  "titleUserContent":"CONTENIDO DEL USUARIO.",
  "text1UserContent":"<b>LOFTY APPS</b> podrá, a su sola discreción, cuando considere oportuno, podrá hacer uso de la información puesta a disposición por el usuario en la plataforma de <b>LOFTY APPS</b>, incluyendo contenido e información de texto, audio y/o visual, comentarios y opiniones relativos a los Servicios.",
  "text2UserContent":"Todo Contenido del usuario facilitado por usted seguirá siendo de su propiedad. No obstante, al proporcionar Información del usuario a <b>LOFTY APPS</b>, usted otorga una licencia mundial, perpetua, irrevocable, transferible, libre de regalías, con derecho a sublicenciar, usar, copiar, modificar, crear obras derivadas, distribuir, exhibir públicamente, presentar públicamente o de otro modo explotar de cualquier manera dicho Contenido del usuario en todos los formatos y canales de distribución, conocidos ahora o ideados en un futuro (incluidos en relación con los Servicios y la plataforma <b>NO CODE</b> y en sitios y servicios de terceros), sin más aviso o consentimiento de usted y sin requerirse el pago a usted o a cualquier otra persona o entidad.",
  "text3UserContent":"Usted declara y garantiza que: (i) es el único y exclusivo propietario de todo el Contenido de usuario o que tiene todos los derechos, licencias, consentimientos y permisos necesarios para otorgar a <b>LOFTY APPS</b> la licencia al Contenido de usuario como establecido anteriormente; y (ii) ni el Contenido de usuario ni su presentación, carga, publicación o puesta a disposición de otro modo de dicho Contenido de usuario, ni el uso por parte de <b>LOFTY APPS</b> del Contenido de usuario como está aquí permitido, infringirán, malversarán o violarán la propiedad intelectual o los derechos de propiedad de un tercero o los derechos de publicidad o privacidad o resultarán en la violación de cualquier ley o reglamento aplicable.",
  "text4UserContent":"Usted acuerda no proporcionar Contenido de usuario que sea difamatorio, calumnioso, odioso, violento, obsceno, pornográfico, ilícito o de otro modo ofensivo, como determine <b>LOFTY APPS</b>, a su sola discreción, tanto si dicho material pueda estar protegido o no por la ley. <b>LOFTY APPS</b> podrá, a su sola discreción y en cualquier momento y por cualquier motivo, sin avisarle previamente, revisar, controlar o eliminar Contenido de usuario, pero sin estar obligado a ello.",
  "titleNetAccess":"ACCESO A LA RED Y DISPOSITIVOS.",
  "text1NetAccess":"Usted es responsable de obtener el acceso a la red de datos necesario para utilizar los Servicios. Podrán aplicarse las tarifas y tasas de datos y mensajes de su red móvil si usted accede o utiliza los Servicios desde un dispositivo móvil y usted será responsable de dichas tarifas y tasas. Usted es responsable de adquirir y actualizar el hardware compatible o los dispositivos necesarios para acceder y utilizar los Servicios y Aplicaciones y cualquier actualización de estos. <b>LOFTY APPS</b> no garantiza que los Servicios, o cualquier parte de estos, funcionen en cualquier hardware o dispositivo particular. Además, los Servicios podrán ser objeto de disfunciones o retrasos inherentes al uso de Internet y de las comunicaciones electrónicas.",
  "titleSubscription":"SUSCRIPCIÓN DE USUARIO.",
  "text1Subscription":"Esta suscripción es para que el usuario pueda tener mayor cantidad de proyectos, mayor cantidad de datos de prueba, mayor cantidad de colaboradores, etc. Estos se clasifican de la siguiente manera:",
  "list1Subscription":" <li><b>Intro:</b> está capa posee un costo de Lps. 3,950.00 anual y le permite tener al usuario un máximo de tres proyectos, un máximo de cinco colaboradores por proyecto y 200 datos de prueba por proyecto.</li>",
  "list2Subscription" : "<li><b>Medio:</b> está capa posee un costo de Lps. 10,550.00 anual y le permite al usuario tener un máximo de 10 proyectos, un máximo de 10 colaboradores por cada proyecto, 500 datos de prueba por proyecto y un descuento del 5% de descuento en la exportación de código</li>",
  "list3Subscription":"<li><b>Avanzado:</b> está capa posee un costo de 23,850.00 anual y le permite al usuario no tener límites de proyectos, un máximo de 20 colaboradores por cada proyecto, un límite máximo de 2,000 datos de prueba por proyecto y un descuento del 10% de descuento en la exportación de código.</li>",
  "titleExportCode":"Exportación de Código",
  "text1ExportCode":"Con este servicio el usuario puede exportar la aplicación web. Dicho código poseerá una licencia donde el cliente (usuario) podrá modificar, vender, etc, pero los derechos de autor se reservan para la empresa. El código del cliente (es decir el navegador o parte visual) se exporta en React js. Mientras que el código del servidor se exporta en Node js y Express js. El código que se exporta se cobra de la siguiente manera:",
  "list1ExportCode":"<li>$10 por Colección de datos (Tabla donde se almacena los datos).</li>",
  "list2ExportCode":"<li>$5 por Servicios (Endpoint o Interfaz de acceso para manipular los datos de una colección de datos). </li>",
  "list3ExportCode":"<li>$15 por Sistema de autenticación (estos pueden ser autenticación por correo, google, facebook, etc).</li>",
  "list4ExportCode":"<li>Los Plugins (son funcionalidades ya prefabricadas para implementar en una aplicación) tendrá cada uno su precio y se mostrará en la sección de plugins de la plataforma.</li>",
  "titleDeploySubscription":"Suscripción de despliegue",
  "text1DeploySubscription":"Esta suscripción es para mantener en línea la aplicación web del usuario. Esta se clasifica de la siguiente manera:",
  "list1Deploy":"<ul><b>Plan Intro</b> <li><ul>App web<li>RAM compartida.</li><li>VCPU compartida.</li></ul><li><ul>Backoffice:<li>RAM compartida</li><li>VCPU compartida.</li></ul></li><li><ul>Base de datos<li>RAM compartida</li><li>VCPU compartida.</li><li>Almacenamiento 5GB.</li><li>Asset Storage 1GB.</li></ul></li></ul>",
  "list2Deploy":"<ul><b>Plan Medio</b><li><ul>App web<li>RAM 1GB.</li><li>VCPU compartida.</li></ul><li><ul>Backoffice:<li>RAM 1GB</li><li>VCPU compartida.</li></ul></li><li><ul>Base de datos<li>RAM 1GB</li><li>VCPU compartida.</li><li>Almacenamiento 15GB.</li><li>Asset Storage 2GB.</li></ul></li></ul>",
  "list3Deploy":"<ul><b>Plan Avanzado</b><li><ul>App web<li>RAM 2GB.</li><li>1 VCPU</li></ul><li><ul>Backoffice:<li>RAM 2GB</li><li>1 VCPU</li></ul></li><li><ul>Base de datos<li>RAM 2GB</li><li>1 VCPU</li><li>Almacenamiento 30GB.</li><li>Asset Storage 4GB.</li></ul></li></ul>",
  "titlePasarela":"Pasarela de pago.",
  "text1Pasarela":"La pasarela de pagos de <b>Lofty Apps</b> es el medio por el cuál el cliente puede hacer cobros mediante tarjeta de crédito para sus aplicaciones. <b>LOFTY APPS</b> aplica un cargo por transacción con las siguientes características: La comisión por transacción es del 4.50% (donde el <b>Banco Atlántida</b> le pertenece el 3.80% y a <b>Lofty Apps</b> el 0.70%) más $0.25 de dólar (donde el <b>Banco Atlántida</b> le pertenece $0.15 y a <b>Lofty Apps</b> $0.10).",
  "titlePago":"PAGO.",
  "text1Pago":"Usted entiende que el uso de la Plataforma de <b>LOFTY APPS</b> puede derivar en cargos por los servicios o bienes que reciba de <b>LOFTY APPS</b> (\"Cargos\"). Después de que haya recibido los servicios u obtenido los bienes mediante el uso de la Plataforma, se cobrara la cantidad correspondiente e incluirán los impuestos aplicables cuando se requiera por ley. Los Cargos pagados por usted son definitivos y no reembolsables, a menos que <b>LOFTY APPS</b> determine lo contrario. ",
  "text2Pago": "Todos los Cargos son pagaderos inmediatamente y el pago se facilitará a <b>LOFTY APPS</b> utilizando el método de pago preferido indicado en su Cuenta con el procesamiento de un tercero (Pasarela de Pago), y después de ello <b>LOFTY APPS</b> le enviará un recibo, así como la factura autorizada por el ente gubernamental correspondiente por correo electrónico. Si se determina que el método de pago de su Cuenta principal ha caducado, es inválido o de otro modo no sirve para cobrarle, usted acepta que <b>LOFTY APPS</b>, utilice un método de pago secundario en su Cuenta, si estuviera disponible.",
  "text3Pago": "<b>LOFTY APPS</b>, en cualquier momento y a su sola discreción, se reserva el derecho de establecer, eliminar y/o revisar los Cargos para alguno o todos los servicios o bienes obtenidos a través del uso de los Servicios. En el caso que <b>LOFTY APPS</b> suspenda o cancele su cuenta, se den por terminados los presentes Términos y Condiciones, o cambie la propiedad de <b>LOFTY APPS</b>, usted entiende y acepta que NO recibirá ningún reembolso o indemnización por ello, o por cualquier contenido o datos asociados con su cuenta, o para cualquier otra cosa, excepto si <b>LOFTY APPS</b> está de acuerdo con ello bajo su sola discreción.",
  "titleGestion":"GESTIÓN DE LA INFORMACIÓN DEL USUARIO.",
  "text1Gestion":"La persona que desea utilizar la herramienta <b>LOFTY APPS</b> deberá de dar la siguiente información: correo, contraseña, nombre completo, Empresa (opcional) y país. Esta información quedará almacenada en nuestro servidor de base de datos. Para utilizar los servicios de la plataforma este deberá de ingresar su tarjeta de crédito o débito (únicamente pueden ser Visa o Mastercard). Esta información se almacenará de manera encriptada en nuestros servidores únicamente se dejará visualizar los últimos 3 dígitos de la tarjeta para la visualización del usuario dueño de la tarjeta.",
  "mainRenuncias":"RENUNCIAS; LIMITACIÓN DE RESPONSABILIDAD; INDEMNIDAD.",
  "titleRenuncias":"RENUNCIA",
  "text1Renuncias":"<b>LOFTY APPS</b> RENUNCIA A TODA DECLARACIÓN Y GARANTÍA, EXPRESA, IMPLÍCITA O ESTATUTARIA, NO EXPRESAMENTE ESTABLECIDA EN ESTOS TÉRMINOS Y CONDICIONES, INCLUIDAS LAS GARANTÍAS IMPLÍCITAS DE COMERCIABILIDAD, IDONEIDAD PARA UN FIN PARTICULAR Y NO VIOLACIÓN. ADEMÁS, <b>LOFTY APPS</b> NO HACE DECLARACIÓN NI PRESTA GARANTÍA ALGUNA RELATIVA A LA FIABILIDAD, PUNTUALIDAD, CALIDAD, IDONEIDAD O DISPONIBILIDAD DE CUALQUIER SERVICIOS, COLABORACION O BIENES A TRAVÉS DE LA PLATAFORMA, O QUE NO SERÁN INTERRUMPIDOS O ESTARÁN LIBRES DE ERRORES. <b>LOFTY APPS</b> NO GARANTIZA LA CALIDAD, IDONEIDAD, SEGURIDAD O HABILIDAD DE LOS USUARIOS DEL USUARIO. USTED ACUERDA QUE TODO RIESGO DERIVADO DE SU USO DE LA PLATAFORMA, COLABORACION O SERVICIO EN RELACIÓN CON AQUELLOS SERÁ ÚNICAMENTE SUYO, EN LA MÁXIMA MEDIDA PERMITIDA POR LA LEY APLICABLE.",
  "titleLimitations":"LIMITACIÓN DE RESPONSABILIDAD.",
  "text1Limitations" :"<b>LOFTY APPS</b> NO SERÁ RESPONSABLE DE DAÑOS INDIRECTOS, INCIDENTALES, ESPECIALES, EJEMPLARES, PUNITIVOS O EMERGENTES, INCLUIDOS EL LUCRO CESANTE, LA PÉRDIDA DE DATOS, LA LESIÓN PERSONAL O EL DAÑO A LA PROPIEDAD, NI DE PERJUICIOS RELATIVOS, O EN RELACIÓN CON, O DE OTRO MODO DERIVADOS DE CUALQUIER USO DE LA PLATAFORMA NO CODE O USUARIOS DE ESTA, INCLUSO AUNQUE <b>LOFTY APPS</b> HAYA SIDO ADVERTIDO DE LA POSIBILIDAD DE DICHOS DAÑOS. <b>LOFTY APPS</b> NO SERÁ RESPONSABLE DE CUALQUIER DAÑO, RESPONSABILIDAD O PÉRDIDA QUE DERIVEN DE: (I) SU USO O DEPENDENCIA DE LOS SERVICIOS BRINDADOS POR SU PLATAFORMA NO CODE O SU INCAPACIDAD PARA ACCEDER O UTILIZAR LOS SERVICIOS DE LA PLATAFORMA NO CODE; O (ii) CUALQUIER TRANSACCIÓN O RELACIÓN ENTRE USTED Y CUALQUIER USUARIOS DEL USUARIO, AUNQUE <b>LOFTY APPS</b> HUBIERA SIDO ADVERTIDO DE LA POSIBILIDAD DE DICHOS DAÑOS. <b>LOFTY APPS</b> NO SERÁ RESPONSABLE DEL RETRASO O DE LA FALTA DE EJECUCIÓN RESULTANTE DE CAUSAS QUE VAYAN MÁS ALLÁ DEL CONTROL RAZONABLE DE <b>LOFTY APPS</b>.",
  "text2Limitations":"LAS LIMITACIONES Y LA RENUNCIA EN ESTE APARTADO NO PRETENDEN LIMITAR LA RESPONSABILIDAD O ALTERAR SUS DERECHOS COMO CONSUMIDOR QUE NO PUEDAN EXCLUIRSE SEGÚN LA LEY APLICABLE.",
  "titleIndemnidad":"INDEMNIDAD.",
  "text1Indemnidad":"Usted acuerda mantener indemnes y responder frente a <b>LOFTY APPS</b> y sus consejeros, directivos, empleados y agentes por cualquier reclamación, demanda, pérdida, responsabilidad y gasto (incluidos los honorarios de abogados) que deriven de: (i) su uso de la plataforma NO CODE, servicios o bienes obtenidos a través de su uso de los Servicios; (ii) su incumplimiento o violación de cualquiera de estos Términos y Condiciones; (iii) el uso por parte de <b>LOFTY APPS</b> de su Contenido de usuario; o (iv) su infracción de los derechos de cualquier tercero, incluidos los Usuarios del usuario.",
  "titleLegislacion":"LEGISLACIÓN APLICABLE",
  "text1Legislacion":"La relación contractual entre el usuario y <b>LOFTY APPS</b> se regirá por y se interpretará de conformidad con las leyes de la República de Honduras.",
  "text2Legislacion":"Cualquier controversia y conflicto entre las partes, relacionados directa o indirectamente con este contrato, ya sea de su naturaleza, interpretación, cumplimiento, ejecución, terminación, resolución, recensión, indemnización aplicable y cualquiera de sus regulaciones supletorias del mismo, se resolverá en los Juzgados y/o Tribunales de la Republica de Honduras.",
  "titleNotifications":"NOTIFICACIONES.",
  "text1Notifications":"<b>LOFTY APPS</b> podrá notificar por medio de una notificación general en los Servicios, mediante un correo electrónico enviado a su dirección electrónica en su Cuenta o por comunicación escrita enviada a su dirección, según lo dispuesto en su Cuenta. Usted podrá notificar a <b>LOFTY APPS</b> por comunicación escrita a la dirección de <b>LOFTY APPS</b> en Honduras (<span style=\"color: red\">*** Definir la dirección a usar</span>).",
  "titleDisposiciones":"DISPOSICIONES GENERALES.",
  "text1Disposiciones":"No podrá ceder ni transferir estos Términos y Condiciones, en todo o en parte, sin el consentimiento previo por escrito de <b>LOFTY APPS</b>. Usted da su aprobación a <b>LOFTY APPS</b> para ceder o transferir estos Términos y Condiciones, en todo o en parte, incluido a: (i) una subsidiaria o un afiliado; (ii) un adquirente del capital, del negocio o de los activos de <b>LOFTY APPS</b>; o (iii) un sucesor por fusión. No existe entre usted, <b>LOFTY APPS</b> o cualquier Usuario Colaborador una empresa conjunta o relación de socios, empleo o agencia como resultado del contrato entre usted y <b>LOFTY APPS</b> o del uso de los Servicios.",
  "text2Disposiciones":"Si cualquier disposición de estos Términos y Condiciones se considerara ilegal, nula o inexigible, ya sea en su totalidad o en parte, de conformidad con cualquier legislación, dicha disposición o parte de ésta se considerará que no forma parte de estos Términos y Condiciones, aunque la legalidad, validez y exigibilidad del resto de las disposiciones de estos Términos y Condiciones no se verá afectada. En ese caso, las partes deberán reemplazar dicha disposición ilegal, nula o inexigible, en todo o en parte por una disposición legal, válida y exigible que tenga, en la medida de lo posible, un efecto similar al que tenía la disposición ilegal, nula o inexigible, dados los contenidos y el propósito de estos Términos y Condiciones. Estos Términos y Condiciones constituyen el contrato íntegro y el entendimiento entre las partes en relación con el objeto y sustituye y reemplaza a todos los contratos o acuerdos anteriores o contemporáneos en relación con dicho objeto.",
  "warningTextTERMS": "<b>Nos reservamos el derecho a modificar los presentes Términos y Condiciones. <span style=\"color: red\"> Última actualización: 29 de abril de 2022</span>. </b>",
  "titlesPrivacyPolitics":"POLÍTICA DE PRIVACIDAD",
  "text1Privacy":"La presente Política de Privacidad establece los términos en que <b>LOFTY APPS</b> usa y protege la información que es proporcionada por sus usuarios al momento de utilizar la plataforma NO CODE. <b>LOFTY APPS</b> está comprometido con la seguridad de los datos de sus usuarios. Cuando le pedimos llenar los campos de información personal con la cual usted puede ser identificado, lo hacemos asegurando que sólo se empleará de acuerdo con los términos de este documento. Sin embargo esta Política de Privacidad puede cambiar con el tiempo o ser actualizada por lo que le recomendamos y enfatizamos revisar continuamente esta página para asegurarse que está de acuerdo con dichos cambios",
  "titleNotChosen":"Información que es recogida",
  "text1NotChosen":"La plataforma NO CODE de <b>LOFTY APPS</b> recoge información personal por ejemplo: información de contacto: nombre, correo electrónico y datos demográficos. Además, cuando sea necesario adquirir productos o servicios, será requerida información de una tarjeta de crédito o débito específica para procesar el pago y así como la información del usuario para la emisión de la factura correspondiente. También recopilamos información de identificación personal (incluido contraseña, comunicaciones), comentarios, sugerencias, reseñas de productos, recomendaciones y perfil personal.",
  "text2NotChosen":"Recolectamos información que sea proporcionada de manera voluntaria o automática como ser información personal. Recibimos, recopilamos y almacenamos cualquier información que ingrese en nuestro sitio web o nos proporciones de otra manera. Además, recogemos la dirección de protocolo de Internet (IP) utilizada para conectar tu computadora a Internet; datos de inicio de sesión, dirección de correo electrónico, contraseña, información de la computadora y la conexión y el historial de compras. Podemos usar herramientas de software para medir y recopilar información de la sesión, incluidos los tiempos de respuesta de la página, la duración de las visitas a determinadas páginas, la información de interacción de la página y los métodos utilizados para navegar fuera de la página.",
  "titleInfoUse":"Uso de la información recogida",
  "text1InfoUse":"La plataforma NO CODE de <b>LOFTY APPS</b> emplean la información con el fin de proporcionar el mejor servicio posible, particularmente para mantener un registro de usuarios y que todos estén debidamente identificados por seguridad y usabilidad. Es posible que sean enviados correos electrónicos periódicamente a través de nuestras cuentas con información específica del uso de nuestra plataforma, facturas, ofertas especiales y otra información publicitaria que consideremos relevante para usted o que pueda brindarle algún beneficio, estos correos electrónicos serán enviados a la dirección que usted proporcione al registrarse y podrán ser cancelados en cualquier momento. LOFTY APPS está altamente comprometido para cumplir con el compromiso de mantener su información segura. Usamos los sistemas más avanzados y los actualizamos constantemente para asegurarnos que no exista ningún acceso no autorizado. ",
  "text2InfoUse":"Cuando realizas una transacción en nuestra página web, como parte del proceso, recopilamosinformación personal que nos proporcionas, como tu nombre, dirección física y dirección de correo electrónico. Tu información personal será utilizada solo para los motivos específicos indicados anteriormente.",
  "text3InfoUse":"Recopilamos dicha información personal y no personal para los siguientes propósitos:",
  "text4InfoUse":"Para proporcionar y operar los servicios;",
  "text5InfoUse":"Para proporcionar a nuestros usuarios asistencia continua al cliente y soporte técnico;",
  "text6InfoUse":"Para poder contactar a nuestros visitantes y usuarios con avisos generales y personalizados relacionados con el servicio y mensajes promocionales;",
  "text7InfoUse":"Para crear datos estadísticos agregados y otra información no personal agregada o deducida, que nosotros o nuestros socios comerciales podamos utilizar para proporcionar y mejorar nuestros servicios respectivos;",
  "text8InfoUse":"Para cumplir con las leyes y regulaciones aplicables.",
  "text9InfoUse": "Podemos comunicarnos contigo para notificarte sobre tu cuenta, para solucionar problemas con tu cuenta, resolver una disputa, cobrar tarifas o dinero adeudado, para sondear tus opiniones a través de encuestas o cuestionarios, para enviar actualizaciones sobre nuestra empresa, o cuando sea necesario para contactarte para hacer cumplir nuestro Acuerdo de usuario, las leyes nacionales aplicables y cualquier acuerdo que podamos tener contigo. A estos efectos, podemos comunicarnos contigo por correo electrónico, teléfono, mensajes de texto y correo postal.",
  "titleThirdParty":"Enlaces a Terceros",
  "text1ThirdParty":"La plataforma NO CODE de <b>LOFTY APPS</b> contiene enlaces a otros sitios y aplicaciones para su normal funcionamiento. Una vez que usted abandone nuestras aplicaciones, ya no tenemos control sobre al sitio al que es redirigido y por lo tanto no somos responsables de los términos o privacidad ni de la protección de sus datos en esos otros sitios terceros. Dichos sitios están sujetos a sus propias políticas de privacidad por lo cual es recomendable que los consulte para confirmar que usted está de acuerdo con estas.",
  "titleControlInfo":"Control de su información personal",
  "text1ControlInfo":"La plataforma NO CODE de <b>LOFTY APPS</b> necesita de su información personal para su normal funcionamiento, en cualquier momento usted puede solicitar la desactivación de su usuario enviando un correo (<span style=\"color: red\">*** Confirmar Correo</span>) para lo cual nos comprometemos en eliminar todas su información personal y eliminación de su usuario. Cada vez que se le solicite rellenar un formulario, como el de activación de usuario, acepta recibir información por correo electrónico. <b>LOFTY APPS</b> jamás divulgara su información personal que es recopilada sin su consentimiento, salvo que sea requerido por un juez con una orden judicial.",
  "text2ControlerInfo":"<b>LOFTY APPS</b> se reserva el derecho de cambiar los términos de la presente Política de Privacidad en cualquier momento.",
  "titleLegisl":"Legislación",
  "text1Legisl":"La plataforma NO CODE de <b>LOFTY APPS</b>, hará todos sus esfuerzos para garantiza un correcto uso de su información personal para su normal funcionamiento conforme lo establecido en la Constitución de la República, la Ley de Transparencia y Acceso a la Información Pública y su Reglamento, así como demás leyes aplicables con relación a la data colectada y almacenada. Una política de privacidad es una declaración que revela algunas o todas las formas en que una página web recopila, utiliza, divulga y administra los datos de sus visitantes y clientes. Cumple con un requisito legal para proteger la privacidad de un visitante o cliente. Países de todo el mundo tienen sus propias leyes con diferentes requisitos por jurisdicción con respecto al uso de políticas de privacidad, por lo tanto las aquí presente están diseñadas para su validez en la Republica de Honduras. ",
  "titleFinal":"DISPOSICIONES FINALES",
  "textFinal":"Si no deseas que procesemos tus datos, contáctanos. Nos reservamos el derecho de modificar esta política de privacidad en cualquier momento, por lo tanto, revísala con frecuencia. Los cambios y aclaraciones tendrán efecto inmediatamente después de su publicación en la página web. Si realizamos cambios sustanciales a esta política, te notificaremos que se ha actualizado, para que sepas qué información recopilamos, cómo la usamos y en qué circunstancias, si corresponde, usamos o divulgamos la información. Si deseas: acceder, corregir, modificar o eliminar cualquier información personal que tengamos sobre ti, estás invitado a contactarnos.",
  "warningFinal":"<b>Nos reservamos el derecho a modificar la presente Política de Privacidad.<span style=\"color: red\"> Última actualización de: 16 de mayo de 2022.</span></b>"
}